a = {
    'А': 'ка', 'И': 'ки', 'Р': 'ши', 'Ш': 'ли',
    'Б': 'зу', 'Й': 'фу', 'С': 'ари', 'Щ': 'ни',
    'В': 'ру', 'К': 'ме', 'Т': 'чи', 'Ъ': 'д',
    'Г': 'джи', 'Л': 'та', 'У': 'мей', 'Ы': 'хе',
    'Д': 'те', 'М': 'рин', 'Ф': 'лу', 'Ь': 'ксе',
    'Е': 'ку', 'Ё': 'ку', 'Н': 'то', 'Х': 'ри', 'Э': 'га',
    'Ж': 'зу', 'О': 'мо', 'Ц': 'ми', 'Ю': 'до',
    'З': 'з', 'П': 'но', 'Ч': 'зи', 'Я': 'ма'}
s = input().upper()
b = ''
c = True
for i in s:
    if c:
        b += a[i][0].upper() + a[i][1:]
        c = False
    else:
        b += a[i].lower()
print(b)
